[
  ["木木木","순조로운 성공과 희망의 달성, 매사에 향상 발전이 있어 융성하는 운, 심신 또한 건강하여 장수하게 된다. 부모 형제가 화목하고 자손이 효도하니 가정의 안정을 얻으며, 재운이 있고 사회적인 성취도 이루겠다."],
  ["木木火","탄탄한 기반 위에서 순풍에 돛단 것처럼 순조롭게 성공하며 입신양명하여 만인의 부러움을 받는다. 감정이 풍부하고 침착하며 가정적으로도 착실한 성품으로 남녀 모두 애정운과 부부운이 매우 좋다. 자손까지 번창하는 부귀영화를 누릴 길운이다."],
  ["木木土","의지가 굳고 근면성실하여 자립 대성하게 된다. 일생에 어려운 때가 오는 일 없이 평탄하며 신용을 토대로 사회적 명망을 얻는다. 배우자운도 매우 길하나 건강이 약한 것이 단점이라 하겠다."],
  ["木木金","주거 불안정, 직장 이동 등 환경적인 변수와 장애가 많아 성공운이 불안하다. 가정적으로도 부부간의 불화가 있게 되며, 건강 또한 좋지 못하다. 뇌나 폐에 관련된 질병이 발생할 수 있으니 건강 관리에 많은 노력을 해야한다."],
  ["木木水","칠전팔기하는 노력으로 일시적인 어려움이 찾아온다하여도 극복해 나가며 결국 성공하게 되는 대기만성형이다. 가정적인 화목이 유지되는 가운데 명예가 사방에 떨치고 재물을 쌓으며 부귀영화를 누리게 되는 대길의 운이다."],
  ["木火木","윗사람의 신망을 얻어 성공 발전하게 되는 등 인덕이 있어 협조자를 많이 얻게 되며 부부간의 화합도 이루게 된다. 건강한 가운데 기초가 튼튼하니 입신 출세하고 재물을 모아 장수하고 행복을 누린다."],
  ["木火火","인내력이 부족하고, 조급한 성격으로 인하여 하는 일에 실패가 많겠으며 곤경에 빠지기 쉽다. 그러나 큰 불행이나 실패없이 순조로이 발전하게 될 것이다. 가정적으로도 원만하나 병약하여 심장과 신장계 질환으로 고생한다."],
  ["木火土","감수성이 예민하고 원만한 성품으로 대인관계에 융통성과 처세술이 능하다. 부모의 덕이나 상사의 도움으로 성공 발전을 누리게 되며 좋은 배우자와 순종적인 자녀를 얻게 된다. 단, 자존심이 강하고 욱하는 성격이 있으므로 조심해야 한다. 대체로 무병 장수하는 운이다."],
  ["木火金","일시적으로 성공하나 운세가 곧 하락하게되어 침체되는 운이다. 기초가 불안정하고 가정적으로도 불화하여 겉으로는 화려해 보여도 속은 비어있는 외화내빈격이다. 허세가 심하고 의지력이 약하여 노력을 해도 결실이 보이지 않는다. 신경계통 질환이나 호흡기 질환, 돌발적 사고에 항상 주의해야 할 것이다."],
  ["木火水","고집이 세고 지기 싫어하는 성품으로 대인관계가 원만하지 못해 구설과 분쟁이 많고 뜻밖의 재난으로 화를 당하며 가정적으로도 불화가 심하다. 변화와 변동이 잦고 그 폭이 크며 돌연사 할 위험도 있다. 심장병, 동맥경화 등 질환을 앓으며, 말년을 불안과 고독으로 보내는 극히 흉한 운이다."],
  ["木土木","적극성이 없고 끈기가 약하여 모처럼의 기회가 주어져도 찬스를 살리지 못한다. 반면, 욕심이 많아 일의 시작은 빈번하나 결과가 없다. 부모 형제의 연이 박하며, 부부인연이 없어 갈등이 많고 이별도 수차 경험한다. 신경성 위장병과 간질환으로 일생 고생이 많다."],
  ["木土火","부모의 인연이 적어 초년을 고독하게 보내나 중년부터 자수성가하여 성공하게 된다. 주변에 협력자가 많으면 부부간의 애정이 돈독하고 자녀의 효성이 지극하다. 성격 또한 온유하고 지혜로운 성품으로 특별한 성공은 기대하기 어렵지만 곤궁함이 없는 여생을 보낼 수 있는 평길의 운이다."],
  ["木土土","신중하고 뚝심이 있는 성격이나 너무 신중함이 오히려 추진력을 떨어지게 하므로 큰 성공은 없다. 부모의 덕이 미약하고 위장병과 폐질환으로 평생 고생하며, 부부의 불화는 없으나 금전적 문제로 어려움을 겪는다."],
  ["木土金","만사가 여의치 못하고 모든 일에 장애가 생겨 뜻을 이루기 힘들며 부모형제와 이별하고 타지에서 고생을 하게 된다. 위장과 신장질환에 주의해야 하며, 부부간에 화목하기 힘들다. 대업을 성취하기에는 모자라므로 무난하게 작은 성공과 일상에 만족하는 편이 좋다."],
  ["木土水","의지가 약하고 인내력이 부족한 성품으로 대인관계의 폭이 좁고 소심하다. 성공운은 좋지 못하여 매사에 불평 불만만 생기게 된다. 특히 여성은 결혼에 실패하게 되는 등 애정운에 문제가 많으며, 항상 부부간의 불화가 끊이지 않으니 결혼 후에도 사회활동을 하거나 늦게 결혼하는 편이 좋다."],
  ["木金木","반항적이고 아집이 강하며 자립심이 약하다. 운세는 불안정하여 매사에 실속이 없으며, 가정운도 좋지 않아 부부간의 불화나 고부간의 문제가 생긴다. 남녀 모두 신경계통 질환에 주의해야 하며, 돌발적 재난에 의한 불구의 위험도 있으니 흉한 운이다."],
  ["木金火","기초운이 부족하여 모든 일이 용두사미격으로 흐지부지 끝나게 되고 노력의 댓가가 따르지 않으며 경제적 고충도 심하다. 부모운도 없고 배우자운도 극히 나쁘며, 자식도 걱정거리만 된다. 한평생 직업, 주거 변동으로 공허한 운이며, 말년으로 갈수록 더욱 나빠지게 되는데 자살이나 횡사의 경우도 우려되는 배치이다."],
  ["木金土","성공운이 희박하나 꾸준한 노력을 한다면 어느 정도의 성취는 이룰 수 있다. 침착하고 인내심도 있어 가정적으로는 화목을 누리며 평범한 일상을 보낸다. 다만 과로로 인한 건강상의 문제가 야기되므로 간질환이나 시력저하 등에 주의해야 한다."],
  ["木金金","재지다모(才智多謨)하나 인덕이 없고 시비와 구설이 항시 따르므로 고독과 재난으로부터 벗어나기 힘들다. 가정불화의 흉운도 겹쳐 대내외적으로 극심한 고생과 금전적 고통속에 신경과민, 혈압성 질환, 간기능 장애 등의 건강 문제도 일어나기 쉽다."],
  ["木金水","끈기가 있고 노력은 하나 운이 따라주지 않아 이루어지는 성과는 기대에 미치지 못하며, 근심과 걱정으로 심신이 늘 불안하다. 특히 급변급락(急變急落)의 비애를 맛보게 되기도 하며, 뇌일혈 등의 건강 문제와 자녀의 문제로 인한 고생이 많다."],
  ["木水木","온순하며 정직하고 윗사람을 공대하는 성품으로 주위 사람들의 두터운 신망을 얻는다. 하는 일마다 순조롭고 금전운이 따라 입신양명하게 되는 운이다. 부부간에 다정하고 자손이 번영하며 뛰어난 리더십으로 정치, 사업, 법률계에서 두각을 나타낸다. 다만 순환기 계통, 폐나 신장 질환에 조심해야 한다."],
  ["木水火","부모형제의 덕이 없고 기초운이 불안하여 일시적 성공이 있어도 곧 실패수가 따르는 등 기복이 심하다. 아무리 금전을 벌어도 모이지가 않고 안정된 생활이 불가능하며, 가정운 또한 좋지 않다. 특히 여성의 경우 중년 이전에 남편과 생리사별하게 되는 흉수이다."],
  ["木水土","조급하고 인내심이 부족하고 성품이 원만하지 못하며, 하는 일마다 장애와 재난이 속출한다. 잔병치레로 고생하며 특히 심장과 신장계통이 허약하다. 또한 가정적으로 불화하여 부모, 처자식과 인연이 적어 결국 이별하게 된다."],
  ["木水金","기초운이 안정되고 부모의 덕이 있어 비교적 순탄한 삶을 영위하게 된다. 성품 또한 온순하고 친절하여 타인으로부터 칭찬을 듣게된다. 그러나 수리가 흉(凶)할 경우에는 신경계통의 상해로 병약하게 된다."],
  ["木水水","일시적인 성공은 있으나 곧 좌절과 실패가 찾아와 모두 허망하게 끝난다. 인색하고 이기적으로 재물 욕심이 많아 다른 사람의 비난을 피할 길 없으며, 시비와 언쟁이 많다. 건강상 신경성 노이로제와 위장 계통의 질환으로 고생하게 된다."],
  ["火木木","기초가 튼튼하고 활동력이 왕성하며 환경조건이 유리하므로 매사에 승승장구한다. 부모, 친척간에 화목하고 대인관계가 원만하여 결국 귀인의 도움을 받게 되어 의외의 어려운 일이 닥친다 해도 무난히 해결할 수 있다. 가정운도 양호한 편이며 학업운도 길하다."],
  ["火木火","두뇌가 명석하고 자존심이 강해지지 않으려는 생각으로 열심히 노력하는 사람으로 노력한 만큼의 댓가를 얻는다. 큰 재난없이 평탄한 생활을 영위하며 배우자가 덕이 있어 부부화락(夫婦和樂)하며 심신이 모두 건강하게 장수하는 길수이다."],
  ["火木土","활동적인 성품에 인내력과 끈기를 갖추었으니 성공이 순조롭고 매사에 향상, 발전하여 목적하는 바를 이룬다. 단, 남녀 모두 이성운(異性運)이 다양하므로 남녀관계로 인한 재난이 있을 수 있다. 이 점에 유의한다면 평생 부귀와 장수를 누릴 수 있다."],
  ["火木金","신경이 지나치게 예민하고 지구력이 약해 큰 일을 감당할 능력은 없다. 변화와 변동의 수가 있으니 직장이나 주거의 이동 등 매사가 불안정하며 가정도 불화하게 된다. 뇌질환이나 폐질환에 주의하여야 한다."],
  ["火木水","천지인(天地人)을 겸비하므로 초반에 고난과 풍파가 있다 하더라도 불굴의 기상과 추진력으로 극복해 나간다. 특히 관운이 좋아 명예를 획득하게 되며, 부귀영달 속에 부부애와 화목한 가정이 이루어지는 대길운이다. 단, 신경질환과 신장계통에 주의하여야 한다."],
  ["火火木","주변에 조력자와 협력자가 끊이지 않는다. 또한 합리적인 사고와 추진력이 있어 매사에 순조로운 발전을 이룩한다. 가정적으로도 인덕이 있는 배우자를 만나 백년해로하며, 효성이 지극한 자손을 얻어 일생동안 평안을 누린다. 간질환에 신경쓴다면 장수할 것이다."],
  ["火火火","급하고 정열적인 성품으로 급진전하는 성운을 얻어 일시적인 성공을 누린다. 그러나 기초운이 약하고 지구력이 부족하므로 자칫하면 큰 화를 당할 수도 있다. 가정운은 박약하여 부부간에 구설과 불화가 많고 건강 또한 심장과 혈압성 질환에 유의하여야 한다."],
  ["火火土","군자의 덕이 있어 온화하고 중후한 성품으로 타인의 신임을 얻고 순조로운 전진과 성취로 내실을 다진다. 조급함만 피한다면 매사 순탄한 호운이 도래할 것이며, 화목한 가정 생활을 영위할 수 있다. 위장장애가 있으니 건강관리에 유념해야 한다."],
  ["火火金","인덕이 없이 혼자 고군분투하나 노력의 결실을 맺지 못하고 잦은 직장의 이동 등이 염려된다. 금전적 고충속에 부부간에도 이별수가 생기며 호흡기나 신경계통의 질환으로 고생하는 등 불안과 탄식속에 생애를 보낸다."],
  ["火火水","대단히 불안정한 운명으로 두뇌는 출중하나 큰 일을 도모하기 어렵다. 신경이 예민하고 소심하며 신경질적이다. 일시적으로 성공은 있을 수 있으나 불의의 재난과 파란속에 항상 심신이 고달프게 되며 가정에 항상 우환이 끊이지 않는다. 건강은 뇌일혈, 동맥경화 등을 조심해야 한다."],
  ["火土木","온후하고 아량이 넓어서 대인관계가 원만하나 운세의 흐름이 불안정하여 후반으로 갈수록 실패와 재난이 있어 성공하기 어렵다. 가정적으로도 잦은 부부간의 의견충돌로 별거수가 있으며 위장질환도 염려된다."],
  ["火土火","부모의 덕이 있고 상하간의 협조를 얻어 입신양명하며, 심신이 화평한 가운데 무병장수하게 된다. 온화한 기품에 지혜와 모나지 않은 원만한 처세를 갖추어 다른 사람의 신망과 존경을 얻으며 대내적으로도 부부 금슬이 좋아 백년해로 하며 자손도 부귀하게 된다."],
  ["火土土","두뇌가 출중하며 성실하고 노력하는 타입으로 주변 사람들의 인정을 받는다. 굴곡없는 평탄함 속에 상당한 명예와 지위를 얻어 안락한 생활을 꾸려나가며 가정도 평안하다. 큰 재물을 모으지는 못하나 일생동안 경제적인 어려움을 겪지 않으며, 심장이 약한 것에만 주의하면 장수를 누릴 수 있다."],
  ["火土金","부모와 조상의 음덕으로 평탄한 생활을 영위하여 예의와 신용을 중시하는 명민한 성품으로 사회적인 지위도 확고히 구축한다. 중년 이후에 이성문제로 구설수가 생기며, 배우자와 파탄이 우려되므로 이 점만 주의한다면 행복하고 안정된 삶을 누릴 수 있다."],
  ["火土水","부모의 덕이 있고 수완가여서 한때의 성공은 기대할 수 있다. 그러나 곧 급변하여 흉하게 되며 금전운세가 특히 박약하고, 부부간의 불화가 발생한다. 신체가 허약하여 소화기 계통, 신장질환 및 심장마비의 우려가 있다."],
  ["火金木","감성은 풍부하나 신경이 예민하고 의심이 많으며 도량이 좁다. 매사 실속이 없어 겉보기는 좋으나 내부적으로는 금전적 고충, 직업이나 직장의 변화, 부부간의 반목 등이 염려된다. 신경쇠약, 뇌졸증, 폐질환을 앓을 수 있으며, 뜻밖의 재난으로 불구가 될 수도 있다."],
  ["火金火","아집이 강하며 경거망동하기 쉽고 대인관계의 처세도 나빠 모처럼의 기회조차 놓치게 된다. 돈을 벌어도 나가기 바빠 경제적 곤란을 심하게 겪으며, 가정적으로도 운이 불리하여 고독과 파란이 우려된다. 건강상에도 외상, 화상 등 사고수가 항시 내포되어 있다."],
  ["火金土","성공운이 불안하고 부모덕이 없어 큰 성공은 기대하기 어렵다. 고집이 세고 자만심이 강한 반면, 진취력과 신중성이 있어 생활의 기반은 닦을 수 있다. 그러나 늘 심신이 피곤하고 공허함을 느끼며 건강상으로도 뇌출혈과 기관지, 순환기 계통의 질환을 앓겠다."],
  ["火金金","재능이 출중하고 결단력이 강하나 운세의 흐름이 유동적이라 매사에 뜻하는 바가 이루어지지 않고 뜻밖의 불상사로 고초를 당한다. 배우자와 자녀를 일찍 잃고 고독한 일생을 보내게 되며 시력감퇴, 심장쇠약, 신경질환을 앓을 수 있겠다."],
  ["火金水","재치가 있고 용모도 빼어나며 자부심이 강하다. 간혹 성공운이 있어 명예를 누리나 중도에 시련이 닥쳐 파란과 재앙이 많은 운이다. 가정적으로도 배우자와 화합하지 못하고 고독감을 느끼나 건강운은 대체로 좋은 편이다."],
  ["火金木","선천적인 인덕이 부족으로 인해 어릴 때부터 고생이 심하며, 매사에 급변, 급난의 불상사와 신병의 고통이 따른다. 우연히 뜻밖의 성공을 거두어 입신양명하게 되는 경우도 있다. 그러나 대체로 고독과 재정적 곤경에 봉착하게 되며, 평생 고생을 면하기가 어렵다."],
  ["火金火","신경질적이고 예민한 성품으로 모든 일에 뜻을 이루지 못하고 불안속에서 생활에 쫓긴다. 가정운이 나빠 부부간에 불화가 심하며, 초혼에 실패하는 일이 많고 신경이나 뇌를 상하게 되어 불구, 단명하는 경우도 있게 된다."],
  ["火水土","성쇠가 심한 운세로 하는 일마다 파란이 많고 근심 걱정이 떠나지 않는다. 생활의 불안정과 가족과의 생리사별로 인해 독좌탄식(獨坐嘆息)하게 되며, 자녀와의 인연이 희박하여 무자(無子)의 운이다. 특히 위장이나 심장, 뇌질환에 주의해야 한다."],
  ["火水金","매사에 불성실(不成實)하게 되고 의외의 재난이 겹쳐 극도의 불안정한 삶을 살게 된다. 대인관계가 원만하지 못해 고독하기 쉽고 질병이 끊이지 않는다. 평생 타향에서 떠돌게 되며 단명하게 되는 경우도 있다."],
  ["火水水","두뇌가 명석하고 자부심이 강한 성격으로 처음에는 약간의 발전과 평안을 누리게 된다. 그러나 뜻밖의 재난에 의해 모든 명예와 성공이 일시에 흩어지며 가정운 또한 좋지 못하여 부모, 처자와 이별하며 고독한 가운데 평생을 보내게 된다."],
  ["土木木","외견상 운기가 강하고 좋아 보이나 내면으로는 실속을 갖추지 못한 외화내곤(外華內困)한 운이다. 큰 재물을 모으기 어렵고 심리적인 고민과 갈등이 심하다. 가정적으로도 부모와의 인연이 적고 자녀로 인한 근심이 크다. 특히 여성은 가정의 가계를 책임져야 하는 등 고충이 있다."],
  ["土木火","운기가 그리 좋지 않아 초년에 고생이 많다. 그러나 두뇌가 명석하고 성실한 노력형으로 발전 속도가 더디고 간간이 장애가 끼어들겠으나 결과적으로는 점진적인 발전을 이룬다. 가정적으로는 대체로 화목하며 건강상에 있어 만성피로와 위장계통의 질환에만 주의한다면 천수를 누리겠다."],
  ["土木土","주관이 확실하고 세심한 성격이나 운세에 장애가 많아 순조롭지 못하다. 항상 경제적 고충으로 고생하게 되며, 부부간에는 무난하게 화합하나 체질적으로 허약하여 위장장애, 간기능 쇠약 등의 질환을 앓게 된다. 여성은 중매혼을 택하고 결혼 후에도 사회 활동을 하는 편이 길하다."],
  ["土木金","부운지격(浮雲之格)이라 하여 매사 뜬구름과 같이 불안하며 안일하게 일생을 보내려다가 패가망신하게 되는 경우이다. 직장과 주거에 변동이 심하여 경제적인 고충과 불만이 심화된다. 부모, 배우자와도 대립하여 수심이 많고 말년에 고독해지기 쉽다. 건강상에 있어서도 폐나 호흡기 질환이 염려된다."],
  ["土木水","노력형이고 강직하고 의협심이 강한 성품이므로 열정적으로 일을 도모하지만 성공운이 희박하여 매사에 장애와 난관에 봉착, 좌절하게 된다. 중년 이후로는 부부 사이에도 불화가 있겠으며, 심신이 허약해져 잔병치레를 많이 하게 된다. 특히 신장병, 신경성 질환에 조심해야 한다."],
  ["土火木","노력한 만큼의 댓가를 얻고 실력을 인정받아 순조로운 성공이 이루어진다. 주위 상하관계의 사람으로부터 큰 협력을 얻어 출세하게 되며 재물이 사방으로부터 모아져 부귀쌍전(富貴雙全)하게 된다. 일생동안 무병장수하며 가정적으로도 행복한 가정을 꾸밀 수 있다."],
  ["土火火","활발하고 처세술이 뛰어나며 후덕한 성품으로 주위의 도움이 있어 순탄한 성공으로 이른다. 가정적으로도 현명한 배우자를 얻게 되어 가세가 중흥하며 백년해로하게 된다. 특히 여성에게 좋은 배합으로 부부중심의 행복한 가정을 꾸미게 된다. 단 남자는 과음을, 여자는 자궁암 등 부인병에 주의해야 한다."],
  ["土火土","성실하고 노력하며 원만한 대인관계로 대업을 성취하여 주위의 존경을 받는다. 배우자운도 크게 길하여 성실한 배우자를 만나 행복한 가정을 꾸리게 되며 건강하여 무병장수한다. 직업으로는 교육자, 정치가, 건설업에 진출하면 큰 명예와 부를 얻게 된다."],
  ["土火金","성격이 급하고 신경질적인 면이 있다. 운세가 불안정하여 실패수가 겹치며, 인덕이 없어 주위 사람에게 배신당하는 경우도 있다. 항상 고단한 운명으로 과로로 인한 질병의 우려가 있으며 가정적으로도 부모 형제, 배우자와 융화하지 못하여 심적 갈등이 많다."],
  ["土火水","고집이 세고 신경이 예민한 편으로 의지는 박약하다. 일시적인 성공이 와도 생각이 자주 바뀌고 금전적 갈등으로 변동수가 많으며, 일생을 통해 파란만장한 역경이 되풀이 된다. 손재수나 급사 등이 우려되며 완고한 배우자를 만나 정신적으로 피로하며 이별수도 있다."],
  ["土土木","정직하고 선량한 성품으로 성공운은 있으나 기초가 불안정하니 거주지와 직장의 이동이 잦아 정착하기 힘든 생활을 하게 된다. 인덕과 부모의 덕이 없고 부부간에도 의견대립과 성격차이가 나 가정적으로도 불목한다. 건강에 있어서는 안과 질환과 과도한 음주로 인한 간 질환이 발생한다."],
  ["土土火","정직하고 온유한 성품에 한가지 일에 뜻을 두면 끈기와 집념으로 성취하고자 하는 노력형으로 만사 순조롭게 성공하여 부귀영달을 누리게 된다. 부부간에도 애정이 충만하여 단란한 가정을 꾸리며 신경성 질환에만 주의를 기울인다면 큰 병 없이 장수한다."],
  ["土土土","비상한 재능과 수완으로 운세를 개척해 나간다. 초년에는 비교적 고생이 있으나 점진적인 발전을 보이다가 말년에 이르면 확고한 위치를 차지하게 된다. 특히 재벌의 격으로서 많은 부를 축적할 수 있다. 가정적으로도 비교적 화목한 생활을 하며 신체 또한 건강하다."],
  ["土土金","순조로운 성공운이 발현되어 일의 전개에 막힘이 없이 목적하는 바를 성취하며 평안한 삶을 누리게 된다. 느긋한 마음을 지녔으므로 심신이 건강하고 부부가 화목한 가운데 사회적인 성취가 좀 더디더라도 문제로 여기지는 않는다. 단 남녀 모두 이성문제로 말썽이 일어날 수 있으므로 주의해야 한다."],
  ["土土水","고집이 세고 완고한 성품으로 언변이 탁월하나 타인의 주장을 수용하지 않는 독단적인 면이 있다. 운세가 약하고 인덕이 없어 노력한 만큼의 댓가를 거두기 힘들고 중도에 좌절할 가능성이 크다. 가정적으로도 불화하며 우환이 끊임없이 일어나고 건강 또한 허약하여 신장, 위장 질환을 앓게 되며 특히 급사의 위험이 있다."],
  ["土金木","출세지향적인 성품으로 상사의 신임을 얻어 일시적인 성공은 하지만 기초운이 약해 의외의 난이 자주 발생하여 일시에 모든 것을 잃게 된다. 생활은 경제적 고충이 심하고 부부간에 이별수가 있으며, 자녀로 인한 근심 걱정이 떠날 날이 없다. 신경쇠약 등 질환이 우려되며 고독하고 불우한 말년을 보내게 된다."],
  ["土金火","자기본위이고 무모한 면이 있으며 대인관계에도 원만하지 못하다. 하는 일마다 불의의 재난이 속출하여 성공도 순조롭지 못하며 윗사람의 도움으로 일시적인 출세가 있어도 곧 잃게 된다. 직업, 주거에 변동이 많고 배우자의 방종으로 갈등이 많으며, 자손이 불효한다. "],
  ["土金土","온화하고 정이 많으며 대인관계에 있어 예의를 깍듯이 차려 주위 사람들의 신망을 얻으며, 무슨 일을 해도 순조롭게 성공을 할 수 있다. 소극적인 편이기는 하나 성실하기 때문에 큰 위험은 없으며, 지적인 배우자를 만나 부부가 화합하며 가정이 화목하게 된다. 특히 명예운이 있어 크게 이름을 날릴 수 있으며 무병장수한다."],
  ["土金金","성품이 너무 강하여 고집이 센면이 단점이지만 운세는 비교적 양호한 편으로 목적한 바를 성취하며 명망을 얻게 된다. 가정적으로도 부모의 덕이 있고 부부간에도 다정하게 백년 해로하며, 자손 또한 부귀현달하게 된다. 무병 장수할 운이나 노년기의 신경통 등에 유의해야 한다."],
  ["土金水","무일푼으로 시작하여 자립대성하게 되는 운이다. 자신감과 추진력으로 매사에 활동적으로 임하므로 만사 형통하게 되며, 특히 명예를 얻을 수 있다. 가정적으로도 부부가 화목하며 장수와 오복을 누리게 된다. 정치, 법률 계통에 종사하면 높은 지위를 얻는다."],
  ["土水木","지혜가 있고 재능이 출중하지만 소극적인 성품으로 현실적인 실행력이 결여되어 있고 운세가 약하여 성공으로 이르기 힘들다. 인덕이 없어 사기 등의 피해를 당하며 금전적 고충이 심하다. 배우자 운은 좋은 편이지만 부모와 자식운이 불리해 가정에 항상 우환이 있으며 불안정한 생활을 하게 된다. 건강면에 있어서는 폐와 신장 질환을 주의해야 한다."],
  ["土水火","두뇌가 명석하고 자부심이 강하다. 그러나 뜻하지 않은 재난이 많고 한 가지 일이 잘되면 두가지 고충이 따르는 등 일생동안 성쇠(盛衰)의 기복이 심하다. 부모의 덕이 없으며 부부운마저 불길하여 가정이 불화하며 파란이 많고 불안정한 생애를 보내게 된다. 신장질환과 신경쇠약, 심장질환의 우려가 있으며 수리 획수가 흉수의 경우 급사의 운이다."],
  ["土水土","지모와 재능을 겸비하였으나 결단력과 활동성이 떨어져 나태하며 성공의 기회 또한 놓치기 쉽다. 주거와 직업에 이동이 잦아 생활의 안정을 누리지 못하며 가정적으로도 부모, 배우자, 자녀의 운이 모두 좋지 않다. 신장질환 등에 유의해야 하고, 익사 등 의외의 사고를 만날 수 있다."],
  ["土水金","매사에 불평불만이 많고 번민이 많으며 노력한 만큼의 결과가 나타나지 않는 운이다. 인덕이 없어 주위의 도움도 전혀 기대할 수 없으며 부부간에도 이별수가 따른다. 혈압성 질환, 심장쇠약 등에 특히 주의를 기울여야 하며, 여성의 경우 늦게 결혼하는 것이 좋다."],
  ["土水水","착하고 성실한 성품으로 매사에 꾸준히 노력하는 생활을 하게된다. 그러나 운세가 안정되지 못하고 실패와 성공이 교차하고 결국 아무것도 가진 것이 없는 상태에 놓인다. 가정적으로도 시련이 많고 부부간에 반목하고 불화하니 이별운이 유도된다. 심장마비 등을 주의해야 하며 조난, 급변 등으로 불구가 될 위험이 있다."],
  ["金木木","신경이 예민하고 의심이 많으며 불평불만이 많다. 모든 일이 불안정하여 큰 성공은 어려우며 부부간에 의견대립이 심하다. 신체적으로도 신경쇠약, 호흡기 질환이 우려되며 돌발적 사고에 의한 외상에 주의해야 한다. 여성은 남편이 있어도 가계를 책임져야 하며 이별수를 겪게 되는 운이다."],
  ["金木火","감수성이 예민하고 고집이 센 편이다. 외형적으로는 별 어려움 없이 평탄한 삶을 살아가는 듯이 보이지만 내면은 실속이 없고 만족감을 느끼지 못한다. 매사에 큰 성공은 기대하기 어렵고 특히 배우자와의 의견충돌로 불화가 심하다. 뇌졸증, 신경쇠약 등의 질환을 조심해야 한다."],
  ["金木土","자존심이 강하고 신경이 지나치게 예민하지만 노력형이다. 대체로 평탄한 운세이지만 분주히 노력한 만큼의 댓가는 돌아오지 않는 편이다. 따라서 불평불만이 많은 수이다. 신경성 노이로제, 심장쇠약 등의 우려가 있으며, 특히 여성의 경우 독선적인 배우자를 만나 괴로움을 겪기 쉽다."],
  ["金木金","다정다감한 편이나 의외로 신경이 예민하고 의심이 많다. 환경이 안정되지 못하여 경제적인 고통을 겪는 가운데 인덕마저 없어 항시 불만족한다. 가정적으로는 배우자와 불화하며 이별수가 있다. 자손 또한 덕을 기대하기 어렵다."],
  ["金木水","강한 의지로 한번 시작한 일은 끝을 맺으려는 집념과 끈기는 있으나 운세가 유동적이어서 매사가 수포로 돌아가기 쉽다. 가정적으로는 부모와 불목하고 부부간에 이별수가 있으며, 말년이 고독하게 된다. 뇌질환이나 폐질환에 주의하여야 한다."],
  ["金火木","대인관계가 원만하고 활동적이며 여성의 경우 풍류의 기질이 있고 성품이 따뜻하여 이성에게 인기가 많다. 그러나 성공운이 극도로 약하여 부모덕이 없고 하는 일마다 실패하게 되어 생활이 불안정하다. 신경성 질환이나 간질환에 유의해야 하며, 사고나 자살수도 발생할 수 있다."],
  ["金火火","고집이 강하고 조급한 성격으로 허세가 심하다. 매사에 극단적인 면이 많고 요행을 바라는 탓으로 투기 등으로 인한 손해를 보게 되기도 한다. 가정적으로는 원만한 편이지만 혈압성 질환, 동맥경화 등 건강에 주의해야 하며, 화재 등으로 신체에 상해를 입기 쉽다."],
  ["金火土","초반의 운세는 길하나 후반으로 갈수록 실패와 좌절이 많아 결국 불행하게 되는 흉배합이다. 작은 일을 무시하고 큰 성공만을 바라므로 다가오는 기회조차 잡지 못해 모든 일이 수포로 돌아가고 생활에 실속이 없다. 가정에 파란이 속출하여 부부간에 이별수가 있으며, 폐, 심장, 뇌질환으로 고생한다."],
  ["金火金","자신감이 넘치고 두뇌가 명철하나 오만불손하고 남을 깔보는 경향이 있어 항상 타인과 불화한다. 외형상으로는 그럴듯해 보이지만 실속이 없고 번민과 경제적 고충이 크다. 돌발적 사고에 의한 외상이나 과로로 인한 질병, 신경계통의 이상 등이 우려된다."],
  ["金火水","갖가지 조난과 질병 속에 극도의 불행을 초래하는 대흉배합이다. 외유내강한 성품으로 원만한 대인관계와 의지를 갖추었지만, 인덕이 없고 하는 일마다 불의의 재난을 당하게 된다. 배우자가 병약하거나 혹은 불화하게 되며, 고독하고 곤궁함 속에 일생을 보내게 된다."],
  ["金土木","타고난 환경조건이 좋은 편으로 성공이 순조롭고 목표를 성취하는 듯 보이지만 후반운은 매우 불리하여 하향운을 유도하게 된다. 당뇨병이나 뇌질환을 유의해야 하며, 이 때문에 가정불화가 생기게 되는 등 우환이 끊이지 않는다."],
  ["金土火","의외의 성공으로 명성을 날리게 된다. 성실하고 외교의 수완이 능해 윗사람의 인정을 받아 출세의 길이 열리게 된다. 가정적으로는 건실한 배우자의 덕으로 재산을 축적하여 평안한 생활을 영위한다. 신체적으로도 매우 건강하여 천수를 누릴 수 있고 자손 또한 효성이 지극한 편으로 대대로 그 영화가 이어지게 된다."],
  ["金土土","순조로운 운세를 얻었으니 매사가 뜻대로 이루어지며 재물과 명예를 얻게 된다. 다정다감하고 온화한 성격이면서도 강직하여 처세가 원만한 노력가이다. 가정적으로도 부모가 화목하고 어진 배우자를 만나 화평하며 자녀운도 좋아 다복한 가정을 꾸리게 된다. 건강상으로도 큰 병없이 장수하는 운이다."],
  ["金土金","다소 소극적이고 우유부단하지만 신용을 굳건히 지키는 사람으로 명예를 소중히 생각한다. 기초운이 안정되고 여건이 뒷받침되므로 순탄하게 성공 발전하게 되며 건강운도 양호하다. 부모의 덕이 있으며 자식 또한 효성이 지극해 화목한 가정이 이루어진다."],
  ["金土水","조급하고 초조하며 의지력도 약한 편이라 일시적으로 상승운을 만나 성공하게 되지만 오래가지 않는다.직업과 주거상의 이동이 잦고 하는 일마다 타인의 조력을 얻지 못하고 구설과 풍파가 심하다. 가정적으로 불목하며 사고를 당해 외상의 위험이 있다."],
  ["金金木","주관이 확고하며 강직하나 고집이 세고 고지식한 성품으로 성공발전운은 있어 어느 정도의 명예와 지위를 성취한다. 그러나 가정적으로 불화가 심하며 처자식을 잃게 되는 수가 있다. 신경쇠약, 두통 등 신경성 질환으로 고생한다. 불의의 재난으로 인해 불구가 될 수도 있다."],
  ["金金火","소심하고 완고한 편으로 타인과 쉽게 융화하지 못한다. 무슨 일이든 용두사미격으로 끝을 맺지 못하게 되며 의외의 난관으로 모든것이 무(無)로 돌아가게 된다. 배우자와 이별수가 있으며 자손덕도 박약하며, 일생의 곤궁을 면하기 어렵다."],
  ["金金土","강한 의지력에 두뇌회전이 빠르며 자기 주장이 강하다. 성공운이 길하여 목적한 바를 쉽게 이루며 가정적으로도 화목하다. 심신이 모두 건전하고 안정되어 있어 무병장수를 누릴 수 있으며 태평한 생애를 보낸다."],
  ["金金金","두뇌가 영특하고 유능한 재질을 갖추었으나 자존심이 강하고 대인관계에 있어 융통성이 부족한 단점이 있다. 성공발전의 운기가 있어 재물과 지위를 얻게 되지만 항상 고독한 가운데 가정적으로 불화하고 자손덕이 빈약하여 매사가 불안정하다. 뇌일혈, 심장마비 등 건강상의 문제가 있고, 주변 사람들의 구설이 끊이지 않는다. "],
  ["金金水","의지력이 강하고 친절하며 후덕한 외유내강형의 성품으로 운세상 어느 정도의 성공은 기대되니 상하의 도움을 얻어 입신출세하게 된다. 그러나 도중에 급변몰락이 있어 모든 성공과 명예가 일시에 하락할 수 있으니 주의를 필요로 한다."],
  ["金水木","어질고 온화한 성품에 재능이 있어 매사에 유덕(有德)함으로 주변의 칭찬을 얻는다. 자력으로 입신출세하는 노력형으로써 만사가 형통하며 큰 재물을 얻게 되는 대길수이다. 가정적으로는 부모, 배우자, 자식과 큰 갈등없이 안락한 생활을 누리게 되며, 신체가 강건하여 장수를 누릴 수 있다."],
  ["金水火","재능과 수완이 있고 부모와 윗사람의 도움을 얻어 일시적으로 성공의 운은 보인다. 그러나 기초가 불안하여 중년이 지나면서부터 실패와 성공이 교차되므로 심리적인 불안과 불만이 증폭된다. 가정적으로도 배우자, 자녀와의 알력과 갈등이 있고 건강상으로는 신경쇠약, 혈압성 질환 등에 조심해야 한다."],
  ["金水土","의지가 강하고 고집이 세며 시기심이 많다. 성공운이 있어 어느정도 성취는 거두지만 차츰 실패와 좌절이 많아져 실속없는 명맥만 유지하는 격이다. 부모덕은 있으나 배우자, 자식 덕이 없어 항상 가정생활이 불안정하며 폐질환, 신장질환 등을 앓는다."],
  ["金水金","부모의 덕이 있고 기초운이 안정되어 있어 모든 면에서 목적을 달성하고 만인의 존경과 협조를 얻어 출세하게 되는 길운이다. 남녀 모두 용모가 뛰어나며 덕 있는 배우자를 만나 행복한 가정을 만들게 되며 부귀공명을 누린다. 심신의 안정으로 신체 모두 건강하여 무병장수하게 된다."],
  ["金水水","부모와 윗사람의 도움으로 성공의 길이 순조롭게 열린다. 성격 또한 명랑, 활발하며 재치가 있어 대중에게 인기가 있다. 부부가 화합하며 행복한 가정을 꾸린다. 자손덕도 있으나 드물게는 말년에 의외의 재난이 있어 파란을 맞게 되는 경우도 있다."],
  ["水木木","기초운이 튼튼하여 매사가 마음먹은 대로 진행되고 주변 사람들의 신임을 두텁게 얻어 대성한다. 재물과 명예 또한 가질 수 있게 된다. 자립심이 강하고 노력형으로 의지가 다소 약한 점에만 주의를 기울인다면 가정적으로, 또 건강상으로도 매우 행복하고 무병장수하며 일생에 부귀영달을 누리게 될 것이다."],
  ["水木火","감수성이 예민하고 이해력과 판단력이 뛰어나 사물과 환경을 응용하고 조직하는데 탁월한 능력을 보인다. 만사가 순탄하여 명예와 재물을 순조로이 얻게 된다. 배우자운이 좋아 가운이 번창하게 되며 재능있는 자손을 두게 된다. 건강 또한 큰 질병없이 천수를 누린다."],
  ["水木土","튼튼한 반석 위에 집을 짓는 것과 같이 기초운이 극히 좋으므로 순탄하게 성공하게 된다. 특히 이해력이 뛰어나고 감성이 풍부하여 창조적인 일에 적격이다. 대체로 건강한 편으로 부모, 배우자, 자녀의 운이 모두 좋아 화평한 가정을 영위하게 된다."],
  ["水木金","지모가 출중하고 희생, 봉사정신이 투철하다. 초년에는 성공운이 순조로워 향상, 발전하나 점차 쇠퇴하는 운으로서 나중에는 흉하게 된다. 부모의 덕은 있으나 배우자, 자녀운 모두 좋지 않아 가정적으로 불안정하며 배려하고 도와준 사람으로부터 배신을 당하기도 한다."],
  ["水木水","매사에 초지일관하며 목표를 향하여 질주하는 노력형으로 자립 대성하는 운이다. 초년에는 재난과 고초가 많아 고생이 심하나 중년 이후에는 출세하며 부를 얻을 수 있게 된다. 가정적으로는 원만하나 건강상의 허약함이 있으니 평소에 건강관리에 신경을 써야 한다."],
  ["水火木","성격이 급하고 예민하며 깐깐한 편이지만 대인관계에서는 친절한 편이다. 부모의 덕이 있고 안정된 환경에서 순조로운 발전을 이루게 되지만 의외의 역경을 만나 모든 것이 헛수고로 돌아간다. 배우자 덕이 없어 부부간의 분쟁이 끊이지 않으며 급변을 만나 갑자기 사망할 수도 있는 위험성이 큰 배합이다."],
  ["水火火","정직하고 조급한 성격과 매사에 무모한 행동으로 인하여 곤경을 자초하기도 한다. 가정적으로는 부모, 배우자와 갈등, 반목이 심하고 자식덕이 박약하다. 건강상에 있어도 신장질환, 심장질환에 주의해야 하며, 단명의 수도 있다."],
  ["水火土","성격이 급하고 신경질적이며 인내력이 부족하다. 출생환경이 유복하고 부모, 배우자, 자녀운이 길하여 가정적으로는 화목하지만 성공운이 약하고 인덕이 없어 하는 일마다 중도의 좌절과 실패가 따르며 주거와 직업 또한 불안정하다. 급변이나 화재의 위험성이 있다. 水火金"],
  ["水火金","예민하고 조급하며 신경이 날카로운 편이지만 선량한 성품이다. 인덕이 없어 주변의 구설과 모함이 많으며 발전이 더디고 내면적으로 번민이 많다. 가정적으로도 부모 형제와 인연이 적고 배우자, 자녀운도 불길하여 고독한 일생을 지내며 과로로 인한 질환이 우려된다."],
  ["水火水","극히 흉한 배치로 재난이 중층한 가운데 돌발적 재난이나 사고로 생명을 잃을 수도 있다. 가정적으로도 불화하여 부부간에 이별 수가 있게 되고 항상 수심에 찬 생활을 영위하게 되며 정신이상, 살상 등 극도의 불상사가 생기기도 한다. 水土木"],
  ["水土木","감수성이 예민하고 이해력이 풍부하나 편협한 성품으로 허세와 허영을 부리기 쉽다. 인덕을 전혀 기대할 수 없고 경제적 곤란과 불의의 재난이 겹치므로 일생이 불안하고 변화와 파란만장함을 겪게 된다. 배우자와도 인연이 없으며 뇌질환, 위장질환 등에 조심해야 한다."],
  ["水土火","재기가 뛰어나고 승부근성이 강하나 허영심리가 다분하다. 기초운이 길하여 초반기에는 어느 정도 성공을 거두지만 돌연 횡액을 당할 수도 있다. 가정적으로는 부부지간에 불화하며, 건강 또한 허약체질로서 단명하기 쉽다."],
  ["水土土","승부근성이 강하고 두뇌가 명석하다. 하는 일마다 장애가 따라 중도에 좌절을 겪게 된다. 금전적으로는 소득은 없고 지출이 많아 경제적으로 어려움이 있다. 가정적으로도 부부간에 불화가 잦고 자녀들과 이별하겠으며, 타향에서 고생하며 고독한 일생을 보낸다. 특히 신경쇠약이나 간질환에 유의해야 하며 절골(切骨) 등으로 인한 불구의 염려도 있다."],
  ["水土金","자존심이 강하고 다재다능하나 소극적이고 내성적이다. 과로로 인한 질병을 얻기 쉬우며, 일단 일을 시작하면 불굴의 의지로 추진함으로 큰 성공을 이루게 되지만, 인덕이 없어 주변의 방해를 받기 쉽다. 배우자 운은 좋은 편이나 건강 문제로 항상 근심이 떠나지 않는다."],
  ["水土水","허영심과 허세가 심하고 자존심이 강한 단점이 있으며, 운세가 불안정하여 하는 일에 장애와 고충이 많다. 가정적으로는 부모형제와 불화하고 배우자와 사이가 좋지 못하고 이별수가 있다. 교통사고 등 우연히 일어나는 재난과 사고 등에 조심해야 한다."],
  ["水金木","초반 운세가 길하여 순탄하게 발전한다. 그러나 이는 일시적인 것으로 곧 재난이 닥쳐와 성쇠의 기복이 심하게 된다. 신경이 지나치게 예민하고 의심이 많으며, 결단력이 약하여 매사에 실속을 얻지 못하며 부모와도 조기 사별할 확률이 높다. 폐질환, 호흡기 질환에 주의해야 한다."],
  ["水金火","명랑하고 활발한 성격이나 언행이 신중하지 못하여 다른 사람들로부터 신임을 얻기 힘들다. 부모의 덕이 적고 성공운이 부족하여 제대로 이루어지는 일이 없으며, 경제적으로도 고충이 따르고 가정불화마저 있는 수이므로 자포자기 하기 쉽다. 뇌질환, 신경성 노이로제 등의 질환과 화상에 주의해야 한다."],
  ["水金土","두뇌가 총명하고 활동적인 성품에 성실한 노력가로서 주위의 신용을 얻는다. 뜻하는 일마다 순조롭게 이루어져 부귀영달을 누리게 된다. 부부가 화목하며 자녀들도 효성이 지극하고 많은 사람들을 거느리게 되는 대성공을 거둔다. 무병장수까지 누리게 되는 최상의 운이다."],
  ["水金金","성실하고 단정한 품행에 부모에 대한 효성이 지극하다. 부부간에도 애정이 깊으며 자식덕도 있어 평화로운 가정을 기반으로 사회에서도 비약적 발전을 이루는 대기만성형의 운세이다. 다소 비현실적인 기질로 인한 심리적 불안정만 유념한다면 대내외적으로 대성을 이룬다."],
  ["水金水","온화하고 예의 바르며 두뇌가 명석하다. 상하의 신망이 두터워 협조하는 이가 많으니 매사가 순조롭고 출세의 길이 열리게 된다. 가정적으로도 화목하고 특히 뛰어난 자손을 얻게 되는 운이다. 단, 수액(水厄)을 조심하고 허약체질임을 명심하여 건강 관리에 힘써야 한다."],
  ["水水木","지모가 출중하고 활발한 성품으로 자기 과신과 큰 욕심을 버린다면 안정된 생활을 영위할 수 있게 된다.가정적으로는 배우자가 덕이 있어 화평을 누리며 자녀도 효성이 극진하는 등 매사에 순조로운 발전과 안정이 있다."],
  ["水水火","재능은 있으나 방종하고 행실이 단정치 못하다. 하는 일마다 실패가 따르며 직업과 주거가 불안정하여 경제적, 심리적 고충이 심하다. 심신이 허약하고 부부지간에 불화가 있어 자주 다투게 되며 자녀운도 좋지 않아 말년이 고독하게 된다."],
  ["水水土","재치와 총명함을 갖추었으나 자기 주장과 자만심이 너무 강하다. 인덕은 전혀 기대할 수 없고 항상 분주하며, 노력한 만큼의 결과 또한 기대하기 어렵다. 가정적으로는 우환이 많고 배우자 및 자녀와의 이별수가 있으며, 건강 또한 항상 질병에 시달리게 된다. 특히 여성의 경우 가계를 책임져야 하는 등 심신이 고되다."],
  ["水水金","재능이 있고 유덕하여 상하좌우 모든 사람들의 신망을 얻는다. 재물운, 명예운 모두 왕성하여 큰 성공을 거둘 수 있으며, 유복하고 부부가 화합하는 가정을 꾸릴 수 있다. 심신이 대체로 건강하나 중년 이후에는 위장 장애나 당뇨병 등에 신경 써야 한다."],
  ["水水水","활동적이나 자만심과 고집이 세어 경거망동하기 쉽다. 부모 덕이 있고 기초운이 충실하여 초년에는 순조로이 성공 발전하나 의외의 재난이 겹치게 되고 심신이 병약하여 단명할 수도 있다. 가정적으로는 불화가 심하여 불우하며, 고독하고 곤궁한 중년기와 말년을 보내게 된다."]
]